app/views/home/addnew.html.erb

SELECT language_code, language_name FROM `language` WHERE (avilable='y')
---
  var query=document.getElementById("query").value;
  var language=document.getElementById("language").value;