app/views/home/index.html.erb

                          <%
                          @image=Image.where("image_id = ?",c.cat_id)
                          @imagecount=Image.where("image_id = ?",c.cat_id).count
---
SELECT `images`.* FROM `images` WHERE (image_id = 2000017)
SELECT COUNT(*) FROM `images` WHERE (image_id = 2000018)

                          @catid="ECCMA.eTSR:"+@cmm.to_s
                          @etsr_mm=EtsrMaterialMaster.where("cat_id = ?",@catid).count
---
SELECT COUNT(*) FROM `material_master` WHERE (organization_ID = 'Demo' and datedeleted = '0000-00-00 00:00:00')

                            <%
                              @rxml=RxmlValue.where("cat_id = ? and datedeleted = ? and value!=?",c.cat_id,'0000-00-00 00:00:00','').order(row: :asc).limit(3)
---
SELECT  `rxml_value`.* FROM `rxml_value` WHERE (cat_id = 2000017 and datedeleted = '0000-00-00 00:00:00' and value!='')  ORDER BY `rxml_value`.`row` ASC LIMIT 3