app/views/home/modalclass.html.erb

SELECT `corp_ignames`.`igid` FROM `corp_ignames` WHERE (Class_id = '0161-1#01-042575#1' AND datedeleted = '0000-00-00 00')
---
                @identfy="S"
                @enableigid = CorpIgname.where("Class_id = ? AND datedeleted = ?", @concept_Id,'0000-00-00 00').select(:igid)