app/views/home/view.html.erb

SELECT `xml_rg`.* FROM `xml_rg` WHERE (igid = '0161-1#IG-100001#1' AND property = 'residual current protection type')
---
                                                    <%
                                                    @xmlrg =XmlRg.where("igid = ? AND property = ?", a.igid, a.property)

SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '45' AND controller_name = 'langs' AND page_name = 'view.html.erb' AND language_type = 'en' )
---
                                                <span class="">
                                                  <% @ar_button = Language.select("language_property").where("language_id = ? AND controller_name = ? AND page_name = ? AND language_type = ? ", '45','langs','view.html.erb','ar')%>

SELECT `concept_dn`.`definition_content`, `concept_dn`.`language_name`, `concept_dn`.`term_ID`, `concept_dn`.`language_code` FROM `concept_dn` WHERE (concept_ID = '0161-1#01-1161196#1' and language_code ='en' OR language_name='en')
---
                          <%=hidden_field_tag "legacy",c.legacy_description %>
                          <% @concept=ConceptDn.where("concept_ID = ? and language_code =? OR language_name=?",c.class_id,c.language,c.language).select(:definition_content,:language_name,:term_ID,:language_code)

SELECT `xml_rg`.* FROM `xml_rg` WHERE (igid = '0161-1#IG-100001#1' and datedeleted = '0000-00-00 00:00:00')  ORDER BY `xml_rg`.`row` ASC
---
            <%  r = @data_count.first%>
            <% @xml=XmlRg.where("igid = ? and datedeleted = ?",r.igid,'0000-00-00 00:00:00').order(row: :asc) %>