app/controllers/home_controller.rb

SELECT max(igid) as igid FROM `corp_ignames`
---
    def addnew
        @lang = ConceptDn.group(:language_code).select('language_code,language_name')
        @lang1 = ConceptDn.group(:language_code).select('language_code,language_name').to_sql

        @org=ConceptDn.select(:term_organization_name).distinct
        @max_no=(MaterialMaster.maximum("cmm_material_no"))
        @igid=(CorpIgname.maximum("igid"))