app/controllers/home_controller.rb

    def index
        @organization = current_user.Organization_ID
        if params[:search]
           @vs = params[:search]
           @madein_ksa = MaterialMaster.where("organization_ID = ? AND datedeleted = ?",@organization,'0000-00-00 00:00:00').where("legacy_description like ? OR material_id like ? OR cat_id like ? OR short_description like ? OR long_description like ?","%#{@vs}%","%#{@vs}%","%#{@vs}%","%#{@vs}%","%#{@vs}%").paginate(:page => params[:page], :per_page => 12)
---
SELECT  `material_master`.* FROM `material_master` WHERE (organization_ID = '71' and datedeleted = '0000-00-00 00:00:00') LIMIT 12 OFFSET 12
SELECT COUNT(*) FROM `material_master` WHERE (organization_ID = '71' and datedeleted = '0000-00-00 00:00:00')

    def addnew
        @lang = Orglanguage.select('language_code, language_name').where("avilable=?",'y')
        @org = Organization.select('Legal_name').where("avilable = ?",'y')

        # @org=ConceptDn.select(:term_organization_name).distinct
        @max_no=(MaterialMaster.maximum("cmm_material_no"))
---
SELECT language_code, language_name FROM `language` WHERE (avilable='y')
SELECT `organizations`.`Legal_name` FROM `organizations` WHERE (avilable = 'y')
SELECT MAX(`material_master`.`cmm_material_no`) FROM `material_master`

            else
              @cmm = @cmm.to_i + 1
            end
            @temp_decide = CorpIgname.where("igid = ? ",@igid).count
---
SELECT COUNT(*) FROM `corp_ignames` WHERE (igid = '0161-1#IG-100001#1' )

                  n2=@cmm+"_"+params[:originInput].original_filename.gsub("-","_").to_s
                  # @sql=Countryorigin.create(image_name: n1,image_id: @cmm)

                   @material_master=MaterialMaster.create(username: current_user.name,realname: current_user.name,igid: @igid,cat_id: @cmm,catalog_name: @term_content,material_id: @material_id,datecreated: Time.now,legacy_description: @legacy,short_description: @bs,long_description: @class_1,class_name: @term_content,class_id: @concept_ID,cmm_material_no: @cmm,organization_ID: current_user.Organization_ID,approved_by: '',language: @language_name,lastmodified: Time.now,source_image: n1)
---
INSERT INTO `material_master` (`username`, `realname`, `igid`, `cat_id`, `catalog_name`, `material_id`, `datecreated`, `legacy_description`, `short_description`, `long_description`, `class_name`, `class_id`, `cmm_material_no`, `organization_ID`, `approved_by`, `language`, `lastmodified`, `source_image`, `source_name`, `sts`) VALUES ('ECCMA', 'ECCMA', '0161-1#IG-100001#1', 2000117, 'Circuit-breaker', 'SAM-ZZ', '2016-10-18 06:01:40', '', 'CIRCUIT-BREAKER', 'CIRCUIT-BREAKER', 'Circuit-breaker', '0161-1#01-1161196#1', 2000117, 'Demo', '', 'en', '2016-10-18 06:01:40', x'', 'United States- US', 'N')

                    @prop_value=@prop_value.upcase
                end

                   @rxml_value = RxmlValue.create(row: @prop_seq,Seq: @prop_seq,igid: @igid,cat_id: @cmm,Class: @term_content,classref: @concept_ID,propertyRef: @prop_concept_ID,property: @prop_name,value: @prop_value,source: @prop_source,datecreated: Time.now,lastmodified: Time.now,language: @language_name)
---
INSERT INTO `rxml_value` (`row`, `Seq`, `igid`, `cat_id`, `Class`, `classref`, `propertyRef`, `property`, `value`, `source`, `datecreated`, `lastmodified`, `language`) VALUES (1, 1, '0161-1#IG-100001#1', '2000117', 'Circuit-breaker', '0161-1#01-1161196#1', '0161-1#02-150042#1', 'Global Trade Item Number (GTIN)', '', '', '2016-10-18 06:01:41', '2016-10-18 06:01:41', 'en')

    def view
        @cat_id=params[:cat_id]
        @len=Setting.where("organization_ID=123")
        @data=MaterialMaster.where("cat_id = ?",@cat_id)
        @data1=RxmlValue.where("cat_id = ? and datedeleted = ?",@cat_id,'0000-00-00 00:00:00').order(row: :asc)

        @data_count=RxmlValue.where("cat_id = ? and datedeleted = ?",@cat_id,'0000-00-00 00:00:00').select(:row,:igid).limit(1).order(row: :desc)

        # @data2=MaterialMaster.where("cat_id = ?",@cat_id).select(:igid).limit(1)
        @image=Image.where("image_id = ?",@cat_id)
        @imagecount=Image.where("image_id = ?",@cat_id).count
        @cmm="ECCMA.eTSR:"+@cat_id
        @etsr_mm=EtsrMaterialMaster.where("cat_id = ? and datedeleted = ?",@cmm,'0000-00-00 00:00:00').count

        # @imageorigin=Countryorigin.where("image_id = ?",@cat_id)
        # @imagecount=Image.where("image_id = ?",@cat_id).count

        # @lang = ConceptDn.group(:language_code).select('language_code,language_name')
        # @org=ConceptDn.select(:term_organization_name).distinct
        @lang = Orglanguage.select('language_code, language_name').where("avilable=?",'y')
        @org = Organization.select('Legal_name').where("avilable = ?",'y')
---
SELECT  `settings`.* FROM `settings` WHERE (organization_ID=123)  ORDER BY `settings`.`id` ASC LIMIT 1
SELECT  `material_master`.* FROM `material_master` WHERE (cat_id = '2000117')  ORDER BY `material_master`.`id` ASC LIMIT 1
SELECT `rxml_value`.* FROM `rxml_value` WHERE (cat_id = '2000117' and datedeleted = '0000-00-00 00:00:00')  ORDER BY `rxml_value`.`row` ASC
SELECT  `rxml_value`.`row`, `rxml_value`.`igid` FROM `rxml_value` WHERE (cat_id = '2000117' and datedeleted = '0000-00-00 00:00:00')  ORDER BY `rxml_value`.`row` DESC LIMIT 1
SELECT `images`.* FROM `images` WHERE (image_id = '2000117')
SELECT COUNT(*) FROM `images` WHERE (image_id = '2000117')
SELECT COUNT(*) FROM `material_master` WHERE (cat_id = 'ECCMA.eTSR:2000117' and datedeleted = '0000-00-00 00:00:00')
SELECT language_code, language_name FROM `language` WHERE (avilable='y')
SELECT `organizations`.`Legal_name` FROM `organizations` WHERE (avilable = 'y')

    def update
        if params[:delete]=='delete'
          @seq = params[:seq]
          @cat_id = params[:cat_id]
          check =  RxmlValue.where('cat_id=? and datedeleted=?',@cat_id,'0000-00-00 00:00:00').count
          if check.to_i == 1
            flash[:alert] = "Sorry you can't to delete the last property"
            redirect_to controller: 'home',action: 'view',cat_id: @cat_id
          else
            @update = RxmlValue.where('cat_id =? AND Seq =?',@cat_id,@seq).update_all(datedeleted: Time.now)
---
UPDATE `rxml_value` SET `rxml_value`.`value` = 'BLACK POLYURETHANE', `rxml_value`.`source` = '', `rxml_value`.`lastmodified` = '2016-10-18 06:16:53' WHERE (Seq = '1' AND property = 'ARM MATERIAL' AND cat_id = '2000117' )

            @len_ld=res["length_LD"]
            @len_sd=res["length_SD"]

            @imagecount=Image.where("image_id = ?",@id).count
---
SELECT COUNT(*) FROM `images` WHERE (image_id = '2000117')

                  @name=@id1.original_filename.gsub("-","_")
                  n1=@cmm+"_"+@name
                  n2=@cmm+"_"+params[:pictureInput].original_filename.gsub("-","_").to_s
                  @sql=Image.where('image_id=?', @cmm).update_all(image_name: n1)
---
UPDATE `images` SET `images`.`image_name` = '2000117_2000001_28818R.jpg' WHERE (image_id='2000117')

                  n1=@cmm+"_"+@nameorigin
                  n2=@cmm+"_"+params[:originInput].original_filename.gsub("-","_").to_s
                  # @sql=Countryorigin.where("image_id = ?",@cmm).update_all(image_name: n1)
                  @update1=MaterialMaster.where('cat_id = ?',@id).update_all({short_description: @bs,long_description: @class,lastmodified: Time.now,source_image: n1})
---
UPDATE `material_master` SET `material_master`.`short_description` = 'CIRCUIT-BREAKER,BLACK POLYURETHANE,SIDE', `material_master`.`long_description` = 'CIRCUIT-BREAKER,ARM MATERIAL:BLACK POLYURETHANE,ARM STYLE:HEIGHT ADJUSTABLE ARMREST,BASE END FEATURE:PLASTIC GLIDE TUBE,DECORATIVE FINISH:BLACK SPECIAL STRETCHABLE FABRIC SEAT,DESIGN TYPE:SIDE,FRAME MATERIAL:NYLON BACK WITH ELASTIC MESH,NYLON LUMBER SUPPORT PAD,FRAME SIZE:32MM DIA X 1.5MM THK CANTILEVER,FRAME SURFACE TREATMENT:STOVE ENAMELED,BLACK MESH,OVERALL HEIGHT:940MM,SEAT TOP HEIGHT FROM FLOOR:480MM,UPHOLSTERY MATERIAL:MOULDED POLYURETHANE FOAM,WIDTH:630MM', `material_master`.`lastmodified` = '2016-10-18 06:16:52', `material_master`.`source_name` = 'United States- US', `material_master`.`sts` = 'N' WHERE (cat_id = '2000117')

    def loadexisting
        if params[:concept_ID]
        @concept_ID = params[:concept_ID]
            @enable = CorpIgname.where("Class_id = ? AND datedeleted = ?", @concept_ID,'0000-00-00 00').select(:Class_id).count

            respond_to do |format|
                format.html {render :layout => false}
            end
        end

        if params[:term_content]
            @term_content = params[:term_content]
            @igid = params[:igid].squish!
            @load = XmlRg.where("class_name = ? AND datedeleted = ? AND igid = ?", @term_content,'0000-00-00 00',@igid).select(:property,:propertyRef,:termID,:definitionID,:Property_Definition).order(row: :asc)

            @loadcount=XmlRg.where("class_name = ? AND datedeleted = ?", @term_content,'0000-00-00 00').select(:property).count
---
SELECT `xml_rg`.`property`, `xml_rg`.`propertyRef`, `xml_rg`.`termID`, `xml_rg`.`definitionID`, `xml_rg`.`Property_Definition` FROM `xml_rg` WHERE (class_name = 'Circuit-breaker' AND datedeleted = '0000-00-00 00' AND igid = '0161-1#IG-100001#1')  ORDER BY `xml_rg`.`row` ASC
SELECT COUNT(`xml_rg`.`property`) FROM `xml_rg` WHERE (class_name = 'Circuit-breaker' AND datedeleted = '0000-00-00 00')